Revit 2024 API
FormArrayIterator Class
An iterator to a form array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class FormArrayIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class FormArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class FormArrayIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FormArrayIterator
See Also
FormArrayIterator Members
Autodesk.Revit.DB Namespace